Reports/20240731_200711/API Testing/20240731_200712/requests/main/7.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2024-07-31T13:07:24.853Z",
      "request" : {
        "method" : "SOAP",
        "url" : "https://www.crcind.com/csp/samples/SOAP.Demo.CLS?WSDL=1",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "SOAPAction",
          "value" : "http://tempuri.org/SOAP.Demo.GetDataSetByName"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=utf-8"
        } ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : "1"
        } ],
        "postData" : {
          "mimeType" : "text/xml; charset=utf-8",
          "text" : "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:tem=\"http://tempuri.org\">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <tem:GetDataSetByName>\n         <tem:name>gero et</tem:name>\n      </tem:GetDataSetByName>\n   </soapenv:Body>\n</soapenv:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "no-cache"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/8.5"
        }, {
          "name" : "Set-Cookie",
          "value" : "CSPSESSIONID-SP-443-UP-csp-samples-=002000010000pPfPGfInIf0000h8sSNXVFoE_gMio5qV9HfA--; path=/csp/samples/;  secure; httpOnly;"
        }, {
          "name" : "Set-Cookie",
          "value" : "CSPWSERVERID=c2ad966d40a2e2c3c152fa8a10c2ee09c4c78531; path=/; httpOnly; secure;"
        }, {
          "name" : "Pragma",
          "value" : "no-cache"
        }, {
          "name" : "Expires",
          "value" : "Thu, 29 Oct 1998 17:04:19 GMT"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Date",
          "value" : "Wed, 31 Jul 2024 13:09:04 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "text/xml; charset=UTF-8"
        }, {
          "name" : "X-Powered-By",
          "value" : "ASP.NET"
        } ],
        "content" : {
          "size" : 1750,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"UTF-8\" ?>\r\n<SOAP-ENV:Envelope xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:s='http://www.w3.org/2001/XMLSchema'>\r\n  <SOAP-ENV:Body><GetDataSetByNameResponse xmlns=\"http://tempuri.org\"><GetDataSetByNameResult>\r\n<s:schema id=\"ByNameDataSet\" targetNamespace=\"http://tempuri.org/ByNameDataSet\" xmlns=\"http://tempuri.org/ByNameDataSet\" xmlns:mstns=\"http://tempuri.org/ByNameDataSet\" attributeFormDefault=\"qualified\" elementFormDefault=\"qualified\" xmlns:s=\"http://www.w3.org/2001/XMLSchema\" xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\">\r\n  <s:element name=\"ByNameDataSet\" msdata:IsDataSet=\"true\">\r\n    <s:complexType>\r\n      <s:choice maxOccurs=\"unbounded\">\r\n        <s:element name=\"ByName\">\r\n          <s:complexType>\r\n            <s:sequence>\r\n              <s:element name=\"ID\" type=\"s:long\" minOccurs=\"0\" />\r\n              <s:element name=\"Name\" type=\"s:string\" minOccurs=\"0\" />\r\n              <s:element name=\"DOB\" type=\"s:date\" minOccurs=\"0\" />\r\n              <s:element name=\"SSN\" type=\"s:string\" minOccurs=\"0\" />\r\n            </s:sequence>\r\n          </s:complexType>\r\n        </s:element>\r\n      </s:choice>\r\n    </s:complexType>\r\n    <s:unique name=\"Constraint1\" msdata:PrimaryKey=\"true\">\r\n      <s:selector xpath=\".//mstns:ByName\" />\r\n      <s:field xpath=\"mstns:ID\" />\r\n    </s:unique>\r\n  </s:element>\r\n</s:schema>\r\n<diffgr:diffgram xmlns:msdata=\"urn:schemas-microsoft-com:xml-msdata\" xmlns:diffgr=\"urn:schemas-microsoft-com:xml-diffgram-v1\">\r\n<ByNameDataSet xmlns=\"http://tempuri.org/ByNameDataSet\">\r\n</ByNameDataSet>\r\n</diffgr:diffgram>\r\n</GetDataSetByNameResult></GetDataSetByNameResponse></SOAP-ENV:Body>\r\n</SOAP-ENV:Envelope>\r\n",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 407,
        "bodySize" : -1,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 0,
        "blocked" : -1,
        "dns" : -1,
        "send" : 0,
        "wait" : 0,
        "receive" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "7",
        "testObjectId" : "Object Repository/API/SOAP/GetDataSetByName",
        "harId" : "e70927a3-5cf9-43cb-8ce3-e905d1cd09dd",
        "reportFolder" : null
      },
      "time" : 0
    } ],
    "comment" : ""
  }
}